Revit 2027 API
Rebar.GetEndTreatmentTypeId Method
 Get the id of the EndTreatmentType that is applied to the rebar.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId GetEndTreatmentTypeId(
	int end
)
Public Function GetEndTreatmentTypeId (
	end As Integer
) As ElementId
public:
ElementId^ GetEndTreatmentTypeId(
	int end
)
member GetEndTreatmentTypeId :
        end : int -> ElementId
Parameters
end Int32
 0 for the start end treatment, 1 for the end end treatment.
Return Value
ElementId
 The id of a EndTreatmentType, or invalidElementId if the rebar has no end treatment at the specified end.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  end must be 0 or 1.
Example
private void ListEndTreatments(Document doc, List<Rebar> bars)
{
    StringBuilder info = new StringBuilder();
    for (int n = 0; n < bars.Count; n++)
    {
        // get end treatment for both ends of bar
        for (int i = 0; i < 2; i++)
        {
            ElementId treatmentTypeId = bars[n].GetEndTreatmentTypeId(i);
            if (treatmentTypeId != ElementId.InvalidElementId)
            {
                EndTreatmentType treatmentType = doc.GetElement(treatmentTypeId) as EndTreatmentType;
                info.AppendLine(string.Format("End treatment for bar {0} end {1}: {2}", n, i, treatmentType.EndTreatment));
            }
        }
    }
    TaskDialog.Show("Revit", info.ToString());
}
See Also
Reference
Rebar Class
Autodesk.Revit.DB.Structure Namespace